<template>
  <b-container fluid>
    <b-row>
      <b-col>
        <h4 align="center" style="font-weight:700">О аликацији</h4>
      </b-col>
    </b-row>
    <br>
    <b-row>
      <b-col>
        <p style="text-align:justify">
          Апликација се користи у сврху електронског вођења дневника благајне.
          То подразумева унос уплатница и признаница, те могућност њиховог штампања и преузимања.
          Такође, унос свих других података дневника, попут хартија од вредности, улога на штедњи и других.
          Унос података резултира аутоматски попуњеним дневником у којем су срачуната сва примања, издавања и имовина, те се као такав одмах може штампати или преузети. 
          Могуће је штампати и преузети појединачну страницу, завршни рачун или пак цео дневник.
          Уплатнице, признанице и дневник прате стандардни црквени формат.
        </p>
      </b-col>
    </b-row>
    <b-row>
      <b-col>
        <p style="text-align:center;font-weight:700">
          Поставке
        </p>
      </b-col>
    </b-row>
    <b-row>
      <b-col>
        <p style="text-align:justify">
          Како би апликација била спремна за рад, на врху секције ”Дневник благајне” потребно је изабрати годину књижења, где је подразумевана тренутна. 
          Након тога је у секцији ”Партије и позиције” потребно унети партије и позиције примања и издавања, како би их било могуће изабрати приликом уноса уплатница и признаница.
        </p>
        <p style="text-align:justify">
          У секцији ”Поставке” могуће је извршити генерална подешавања апликације.
          Могуће је поставити жељени ниво зумирања и направити резервну копију података. Креирање резервне копије података омогућава њихово трајно чување ван оквира апликације. 
          То је пожељно радити како се подаци не би изгубили услед пада система. Резервну копију је увек могуће учитати унутар исте секције.
        </p>
      </b-col>
    </b-row>
    <b-row>
      <b-col>
        <p style="text-align:center;font-weight:700">
          Коришћење
        </p>
      </b-col>
    </b-row>
    <b-row>
      <b-col>
        <p style="text-align:justify">
          Подаци се уносе у табеле које се налазе у њима одговарајућим секцијама. Ту се такође могу брисати и мењати.
          Брисање је омогућено за више уноса одједном означавањем више ставки табеле, или појединачно. 
          Табеле омогућавају једноставан преглед унетих података и могу се сортирати кликом на заглавље колона.
          У случају признаница и уплатница, такође је могуће филтрирати табелу према месецима.
        </p> 
        <p style="text-align:justify">
          Сваки унос је ограничен према могућем приказу у дневнику благајне, те се о томе не мора водити рачуна.
          Партије и позиције примања и издавања се не морају уносити поново за сваку годину, већ је могућ њихов увоз из претходне године уз помоћ дугмета на врху секције.
          Приликом додавања уплатница и признаница, на основу унетих износа према партијама и позицијама, аутоматски се срачунава укупан износ и креира његова текстуална репрезентација. 
          Такође, уплатницама и признаницама се аутоматски додељује редни број у дневнику према датуму уноса. У случају признаница, износ за партију и позицију ”ЦТ 4%” се аутоматски срачунава по њеном одабиру приликом додавања признанице.
          Приликом прегледа унетих уплатница и признаница могуће је извршити њихово штампање или преузимање.
        </p> 
        <p style="text-align:justify">  
          Преглед дневника благајне се може извршити у сваком тренутку кликом на дугме на врху секције ”Дневник благајне”.
          У току прегледа, навигација кроз стране се може упростити коришћењем пречица на врху приказа.
          Уколико постоји негативна вредност унутар дневника, апликација ће приказати упозорење.
          Уколико се дода више уплатница, признаница и других података него што стаје на једну страницу дневника, аутоматски се додаје нова страна.
          Штампање и преузимање појединачне странице, завршног рачуна или целог дневника, може се извршити одабиром опције из одговарајућег падајућег менија унутар приказа дневника.
        </p>
      </b-col>
    </b-row>
    <br>
    <b-row>
      <b-col>
        <p style="text-align:center;font-weight:700">
          Пречице
        </p>
      </b-col>
    </b-row>
    <b-row>
      <b-col>
        <p align="center"><b>esc</b>&nbsp;&nbsp;&nbsp;изађи из приказа</p>
      </b-col>
    </b-row>
    <b-row>
      <b-col>
        <p align="center"><b>{{phrases.commandOrControl}}</b> + <b>s</b>,<b> enter</b>&nbsp;&nbsp;&nbsp;сачувај</p>
      </b-col>
    </b-row>
    <b-row>
      <b-col>
        <p align="center"><b>{{phrases.commandOrControl}}</b> + <b>e</b>&nbsp;&nbsp;&nbsp;ресетуј унос</p>
      </b-col>
    </b-row>    
    <b-row>
      <b-col>  
        <p align="center"><b>{{phrases.commandOrControl}}</b> + <b>p</b>&nbsp;&nbsp;&nbsp;штампај</p>
      </b-col>
    </b-row>    
    <b-row>
      <b-col>        
        <p align="center"><b>{{phrases.commandOrControl}}</b> + <b>d</b>&nbsp;&nbsp;&nbsp;преузми</p>
      </b-col>
    </b-row>    
    <b-row>
      <b-col>       
        <p align="center"><b>{{phrases.commandOrControl}}</b> + <b>=</b>&nbsp;&nbsp;&nbsp;зумирај</p>
      </b-col>
    </b-row>    
    <b-row>
      <b-col>        
        <p align="center"><b>{{phrases.commandOrControl}}</b> + <b>-</b>&nbsp;&nbsp;&nbsp;одзумирај</p>
      </b-col>
    </b-row>
    <br> 
    <b-row>
      <b-col>
        <h4 align="center" style="font-weight:700">Техничка подршка</h4>
      </b-col>
    </b-row>
    <b-row>
      <b-col>
        <p align="center">daxon.tech@outlook.com</p>
        <p align="center">+381642750071</p>
      </b-col>
    </b-row>
    <hr>
    <br>
    <p align="center">Апликација је лиценцирана од стране агенције DAXON TECH и на њу полаже ауторска права. &copy;</p>
  </b-container>
</template>

<script>
  const i18n = require('../../../../translations/i18n')

  export default {
    data () {
      return {
        phrases: {
          commandOrControl: 'ctrl'
        }
      }
    },
    created () {
       if (process.platform == 'darwin') {
        this.phrases.commandOrControl = 'cmd'
      }
    }
  }
</script>
